{
  "general_advice": "Welcome to FC 26! The meta has shifted towards more physical play, tactical intelligence, and role-specific players. Power Defending is key, and players with new PlayStyles like 'Second Wind+' or 'Box Crasher+' can single-handedly decide matches. Balanced squad building that leverages specific player archetypes is now the most effective path to victory.",
  "key_in_game_stats": [
    {
      "name": "Tactical Intelligence",
      "abbreviation": "TI",
      "description": "Affects a player's ability to hold formation, make intelligent interceptions without user input, and cover for out-of-position teammates. Crucial for CDMs and CBs in formations like the 4-1-3-2."
    },
    {
      "name": "Off-Ball Movement",
      "abbreviation": "OBM",
      "description": "Determines the quality and frequency of attacking runs made by players not in possession. High OBM means players will find space more effectively. Essential for Strikers and Box Crashers."
    },
    {
      "name": "Composure (On-Ball)",
      "abbreviation": "CMP",
      "description": "Governs how well a player can execute passes, shots, and dribbles while under direct pressure from an opponent. High on-ball composure reduces errors significantly and is key for press-resistant players."
    }
  ],
  "meta_formations": [
    {
      "name": "4-1-3-2",
      "description": "The dominant attacking formation in FC 26. Uses a single, intelligent CDM to anchor the midfield, with three attacking midfielders (LM, RM, CAM) creating constant overloads. Requires very athletic, high-stamina players to be effective.",
      "strengths": ["Overwhelming attack", "Multiple passing options", "Strong central presence"],
      "weaknesses": ["Vulnerable to counter-attacks if the CDM is bypassed", "Requires high stamina from all midfielders"],
      "key_player_types": {
        "STs": "One clinical finisher (high Finishing, OBM) and one faster creator (high Dribbling, CMP).",
        "CAM": "The heart of the team. High passing, dribbling, and vision. 'Tiki-Taka+' is ideal.",
        "LM/RM": "Pacey wingers who can cut inside or cross. Must have high stamina and good OBM.",
        "CDM": "A true destroyer. Needs high TI, Defending, and the 'Anchor Man+' PlayStyle.",
        "Fullbacks": "Must be fast, have high stamina, and be capable of joining the attack."
      }
    },
    {
      "name": "5-2-3",
      "description": "A defensive powerhouse and the primary counter to the 4-1-3-2. It uses three central defenders and two wing-backs to create a solid backline, while the three forwards provide a potent counter-attacking threat.",
      "strengths": ["Extremely solid defensively", "Lethal on the counter-attack", "Controls the width of the pitch"],
      "weaknesses": ["Can be passive without the right custom tactics", "Midfield can be overrun by formations with 3+ central midfielders"],
      "key_player_types": {
        "Forwards (LW/ST/RW)": "All three must be incredibly fast to exploit space on the break. 'Technical+' is mandatory.",
        "CMs": "Two balanced box-to-box midfielders who can defend and support the attack. One should be a 'Box Crasher'.",
        "Wing-Backs": "The engine of the team. High stamina, pace, and crossing ability are mandatory. 'Second Wind+' is a massive advantage.",
        "CBs": "The central CB can be a slower, powerful tackler (high Strength, TI), while the outer two need more pace."
      }
    }
  ],
  "playstyles_plus_meta": [
    {
      "name": "Anchor Man+",
      "description": "New S-Tier defensive PlayStyle. Massively increases the success rate and range of standing tackles and physical challenges. Essential for lone CDMs.",
      "positions": ["CB", "CDM"]
    },
    {
      "name": "Second Wind+",
      "description": "Provides a significant boost to all stats (except shooting) after the 75th minute for players with over 80% stamina remaining. A game-changer.",
      "positions": ["CM", "Fullbacks", "Wingers"]
    },
    {
      "name": "Box Crasher+",
      "description": "Significantly enhances the timing and finishing ability of late runs into the box. Improves heading and first-time shot accuracy from these specific runs.",
      "positions": ["CM", "CAM"]
    },
    {
      "name": "Press Breaker+",
      "description": "Grants exceptional close control and strength when dribbling under pressure, making the player highly resistant to tackles. Vital for midfielders.",
      "positions": ["CM", "CAM", "Fullbacks"]
    },
    {
      "name": "Power Header+",
      "description": "Makes headers from crosses and corners significantly more powerful and accurate. Has made Target Man strikers viable again.",
      "positions": ["ST", "CB"]
    },
    {
      "name": "Technical+",
      "description": "Still an S-Tier PlayStyle. Allows for high-speed controlled sprinting ('controlled sprint'), making dribbling incredibly responsive. Essential for elite attackers.",
      "positions": ["Wingers", "CAM", "ST"]
    },
    {
      "name": "Tiki-Taka+",
      "description": "Enables flawless, first-time passes in tight spaces. Perfect for intricate build-up play against deep-lying defenses.",
      "positions": ["CAM", "CM"]
    }
  ],
  "player_archetypes": [
    {
      "role": "Anchor CDM",
      "description": "A purely defensive midfielder whose job is to screen the backline and win the ball back. They are the foundation of single-pivot formations like the 4-1-3-2.",
      "key_stats": ["Defending", "Physicality", "Interceptions", "Tactical Intelligence (TI)"],
      "meta_playstyles": ["Anchor Man+", "Intercept+", "Bruiser+"]
    },
    {
      "role": "Box Crashing Midfielder (Box Crasher)",
      "description": "A midfielder (usually CM) who makes aggressive, late runs into the opponent's penalty area to act as a secondary goal threat. Different from a CAM who creates; this role is about finishing moves.",
      "key_stats": ["Finishing", "Attack Positioning", "Stamina", "Off-Ball Movement (OBM)"],
      "meta_playstyles": ["Box Crasher+", "Power Shot+", "Second Wind+"]
    },
    {
      "role": "Inverted Fullback",
      "description": "A modern fullback who tucks into central midfield when the team is in possession, providing defensive stability against counters and creating passing triangles. Requires high game intelligence.",
      "key_stats": ["Short Passing", "Interceptions", "Def. Awareness", "Tactical Intelligence (TI)"],
      "meta_playstyles": ["Intercept+", "Tiki-Taka+", "Press Breaker+"]
    },
    {
      "role": "Press-Resistant Ball Carrier (CM/CAM)",
      "description": "A midfielder who excels at carrying the ball through the center of the pitch under pressure, breaking the opponent's press and transitioning from defense to attack.",
      "key_stats": ["Dribbling", "Balance", "Strength", "Composure (On-Ball)"],
      "meta_playstyles": ["Press Breaker+", "Technical+", "Flair+"]
    },
    {
      "role": "Target Man Striker",
      "description": "A tall, strong forward who is a primary threat in the air. With the buff to crossing in FC 26, this role has seen a major resurgence for teams that play with width.",
      "key_stats": ["Heading Acc.", "Strength", "Shooting", "Jumping", "Off-Ball Movement (OBM)"],
      "meta_playstyles": ["Power Header+", "Aerial+", "First Touch+"]
    }
  ]
}
